{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "seq_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000, 4], "dtype": "float32", "sparse": false, "name": "seq_input"}, "inbound_nodes": []}, {"name": "conv1d_3", "class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [9], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["seq_input", 0, 0, {}]]]}, {"name": "max_pooling1d_3", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_3", "trainable": true, "dtype": "float32", "strides": [3], "pool_size": [3], "padding": "valid", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.5977908689086315, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_3", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "attention_1", "class_name": "Attention", "config": {"name": "attention_1", "trainable": true, "dtype": "float32", "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "hidden": 256}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.5013123347763774, "noise_shape": null, "seed": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "attention_flatten_1", "class_name": "attention_flatten", "config": {"name": "attention_flatten_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["attention_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["attention_flatten_1", 0, 0, {}], ["dense_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "sigmoid"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["seq_input", 0, 0]], "output_layers": [["activation_1", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}